Tekla Open API Reference for Tekla Structures 2025
Grid.LabelY Property
 The labels for the Y-axis.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string LabelY { get; set; }
Public Property LabelY As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Grid Class
Tekla.Structures.Model Namespace